{
    "metadata": {
      "total_size": 7467679168
    },
    "weight_map": {
      "text_model.lm_head.linear.bias": "model-00002-of-00002.safetensors",
      "text_model.lm_head.linear.weight": "model-00002-of-00002.safetensors",
      "text_model.lm_head.ln.bias": "model-00002-of-00002.safetensors",
      "text_model.lm_head.ln.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.embd.wte.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.0.ln.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.0.ln.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.0.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.0.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.0.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.0.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.0.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.0.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.0.mlp.fc2.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.0.mlp.fc2.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.1.ln.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.1.ln.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.1.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.1.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.1.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.1.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.1.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.1.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.1.mlp.fc2.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.1.mlp.fc2.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.10.ln.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.10.ln.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.10.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.10.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.10.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.10.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.10.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.10.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.10.mlp.fc2.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.10.mlp.fc2.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.11.ln.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.11.ln.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.11.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.11.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.11.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.11.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.11.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.11.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.11.mlp.fc2.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.11.mlp.fc2.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.12.ln.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.12.ln.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.12.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.12.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.12.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.12.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.12.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.12.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.12.mlp.fc2.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.12.mlp.fc2.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.13.ln.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.13.ln.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.13.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.13.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.13.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.13.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.13.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.13.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.13.mlp.fc2.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.13.mlp.fc2.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.14.ln.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.14.ln.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.14.mixer.Wqkv.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.14.mixer.Wqkv.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.14.mixer.out_proj.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.14.mixer.out_proj.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.14.mlp.fc1.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.14.mlp.fc1.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.14.mlp.fc2.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.14.mlp.fc2.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.15.ln.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.15.ln.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.15.mixer.Wqkv.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.15.mixer.Wqkv.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.15.mixer.out_proj.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.15.mixer.out_proj.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.15.mlp.fc1.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.15.mlp.fc1.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.15.mlp.fc2.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.15.mlp.fc2.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.16.ln.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.16.ln.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.16.mixer.Wqkv.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.16.mixer.Wqkv.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.16.mixer.out_proj.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.16.mixer.out_proj.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.16.mlp.fc1.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.16.mlp.fc1.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.16.mlp.fc2.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.16.mlp.fc2.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.17.ln.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.17.ln.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.17.mixer.Wqkv.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.17.mixer.Wqkv.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.17.mixer.out_proj.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.17.mixer.out_proj.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.17.mlp.fc1.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.17.mlp.fc1.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.17.mlp.fc2.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.17.mlp.fc2.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.18.ln.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.18.ln.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.18.mixer.Wqkv.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.18.mixer.Wqkv.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.18.mixer.out_proj.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.18.mixer.out_proj.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.18.mlp.fc1.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.18.mlp.fc1.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.18.mlp.fc2.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.18.mlp.fc2.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.19.ln.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.19.ln.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.19.mixer.Wqkv.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.19.mixer.Wqkv.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.19.mixer.out_proj.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.19.mixer.out_proj.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.19.mlp.fc1.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.19.mlp.fc1.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.19.mlp.fc2.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.19.mlp.fc2.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.2.ln.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.2.ln.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.2.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.2.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.2.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.2.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.2.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.2.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.2.mlp.fc2.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.2.mlp.fc2.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.20.ln.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.20.ln.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.20.mixer.Wqkv.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.20.mixer.Wqkv.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.20.mixer.out_proj.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.20.mixer.out_proj.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.20.mlp.fc1.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.20.mlp.fc1.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.20.mlp.fc2.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.20.mlp.fc2.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.21.ln.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.21.ln.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.21.mixer.Wqkv.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.21.mixer.Wqkv.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.21.mixer.out_proj.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.21.mixer.out_proj.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.21.mlp.fc1.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.21.mlp.fc1.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.21.mlp.fc2.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.21.mlp.fc2.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.22.ln.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.22.ln.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.22.mixer.Wqkv.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.22.mixer.Wqkv.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.22.mixer.out_proj.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.22.mixer.out_proj.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.22.mlp.fc1.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.22.mlp.fc1.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.22.mlp.fc2.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.22.mlp.fc2.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.23.ln.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.23.ln.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.23.mixer.Wqkv.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.23.mixer.Wqkv.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.23.mixer.out_proj.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.23.mixer.out_proj.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.23.mlp.fc1.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.23.mlp.fc1.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.23.mlp.fc2.bias": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.23.mlp.fc2.weight": "model-00002-of-00002.safetensors",
      "text_model.transformer.h.3.ln.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.3.ln.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.3.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.3.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.3.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.3.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.3.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.3.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.3.mlp.fc2.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.3.mlp.fc2.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.4.ln.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.4.ln.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.4.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.4.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.4.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.4.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.4.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.4.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.4.mlp.fc2.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.4.mlp.fc2.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.5.ln.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.5.ln.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.5.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.5.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.5.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.5.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.5.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.5.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.5.mlp.fc2.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.5.mlp.fc2.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.6.ln.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.6.ln.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.6.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.6.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.6.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.6.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.6.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.6.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.6.mlp.fc2.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.6.mlp.fc2.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.7.ln.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.7.ln.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.7.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.7.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.7.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.7.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.7.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.7.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.7.mlp.fc2.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.7.mlp.fc2.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.8.ln.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.8.ln.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.8.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.8.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.8.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.8.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.8.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.8.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.8.mlp.fc2.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.8.mlp.fc2.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.9.ln.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.9.ln.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.9.mixer.Wqkv.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.9.mixer.Wqkv.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.9.mixer.out_proj.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.9.mixer.out_proj.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.9.mlp.fc1.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.9.mlp.fc1.weight": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.9.mlp.fc2.bias": "model-00001-of-00002.safetensors",
      "text_model.transformer.h.9.mlp.fc2.weight": "model-00001-of-00002.safetensors",
    }
  }
  